Exercicios aula 1: Fazedno leitura de arquivo CSV

A codificação do arquivo é ISO-8859-1?

In [ ]:
import chardet

with open('dados_sus.csv', 'rb') as file:
    print(chardet.detect(file.read()))

As três primeiras linhas linhas do arquivo podem ser desconsideradas, pois o cabeçalho só começa na quarta linha.

As 9 últimas linhas também podem ser desconsideradas, pois são apenas informações sobre onde os dados foram obtidos.

In [ ]:
import pandas as pd 

dados = pd.read_csv('dados_sus.csv', encoding='ISO-8859-1', sep=';', skiprows=3, skipfooter = 9, engine='python')
# endoding passa qual é o tipo de codificação do arquivo, skiprows = x diz que voce pula as x primeiras linhas do arquivo na hora da leitura, skipfooter = x diz que voce pula as x ultimas linhas na hora da leitura do arquivo, engine = 'python' o motor usado para ler o arquivo é o Python. Isso é necessário quando se usa o parâmetro skipfooter, pois o motor padrão não suporta essa opção.

dados

Exercicio aula 2:

Neste desafio, a sua função é efetuar a leitura desse link do Google Planilhas e depois salvar o DataFrame obtido no formato CSV. Pronto(a) para começar?

In [ ]:
import pandas as pd 

sheet_id = '1pvBoLyX8kP0TjtUbadVMGdTl4yzm6bHMThhPiqCVtpw'

url_co2 = f'https://docs.google.com/spreadsheets/d/{id}/gviz/tq?tqx=out:csv'

In [ ]:
emissoes_carbono = pd.read_csv(url_co2)
emissoes_carbono.head()

In [ ]:
emissoes_carbono.to_csv('dados_emissoes_co2.csv', index=False)

Exercicios Aula 3

Este DataFrame possui 6 colunas: genus (gênero), name (nome), id, family (família), order (ordem) e nutritions (nutrições). Note que a coluna nutritions está com todas as informações nutricionais aninhadas. Portanto, os dados precisam ser normalizados.

O desafio agora é normalizar esse DataFrame.

In [ ]:
# pegadno os dados 
import pandas as pd
import requests
import json

dados_frutas = requests.get('https://fruityvice.com/api/fruit/all')
resultado = json.loads(dados_frutas.text)

pd.DataFrame(resultado).head()

In [ ]:
# normalizando os dados

import pandas as pd
dados_frutas_normalizado = pd.json_normalize(resultado)

dados_frutas_normalizado.head()

Exercicio aula 4

Vanessa é uma cientista de dados que está realizando algumas análises com dados ambientais. Ela está desenvolvendo um projeto para avaliar o impacto ambiental das atividades humanas em diferentes países do mundo, mas para isso precisa das estimativas populacionais desses países. Ao pesquisar na internet, encontrou uma tabela de estimativas populacionais em um artigo da página.

Assim como Vanessa, seu desafio é obter um DataFrame da tabela que contém as informações do número de habitantes de cada país.

In [ ]:
import pandas as pd 

pd.read_html('https://pt.wikipedia.org/wiki/Lista_de_pa%C3%ADses_por_popula%C3%A7%C3%A3o')[0]

Exercicios Aula 5

Exercicio 1: Criar o banco de dados local com a biblioteca SQLAlchemy.

In [4]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine, MetaData, Table, inspect, text

url = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/clientes_banco.csv'

engine = create_engine('sqlite:///:memory:')

dados = pd.read_csv(url)
dados.head(2)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado

Exercicio 2: Escrever os dados do arquivo CSV neste banco de dados local.

In [5]:
dados.to_sql('Clientes', engine, index=False)

438463

In [6]:
pd.read_sql_table('Clientes', engine).head(2)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado

Exercicio 3: Realizar três atualizações no banco de dados:

Atualizar o registro do cliente de ID 6840104 que teve o rendimento anual alterado para 300000.

Excluir o registro do cliente de ID 5008809, pois essa pessoa não possui mais conta na instituição 
financeira.

Criar um novo registro de cliente seguindo as especificações abaixo:

ID_Cliente: 6850985

Idade: 33

Grau_escolaridade: Doutorado

Estado_civil: Solteiro

Tamanho_familia: 1

Categoria_de_renda: Empregado

Ocupacao: TI

Anos_empregado: 2

Rendimento_anual: 290000

Tem_carro: 0

Moradia: Casa/apartamento próprio

In [11]:
show = text('SELECT * FROM Clientes WHERE ID_Cliente=6840104')
pd.read_sql(show, engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,135000.0,0,Casa/apartamento próprio

In [12]:
query = text('UPDATE Clientes SET Rendimento_anual=300000 WHERE ID_Cliente=6840104 ')

with engine.connect() as conn:
    conn.execute(query)
    conn.commit()

pd.read_sql(show, engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,300000.0,0,Casa/apartamento próprio

In [13]:
show_2 = text('SELECT * FROM Clientes WHERE ID_Cliente=5008809')
pd.read_sql(show_2, engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [16]:
query_2 = text('DELETE FROM Clientes WHERE ID_Cliente=5008809')

with engine.connect() as conn:
    conn.execute(query_2)
    conn.commit()

pd.read_sql(show_2, engine)

Empty DataFrame
Columns: [ID_Cliente, Idade, Grau_escolaridade, Estado_civil, Tamanho_familia, Categoria_de_renda, Ocupacao, Anos_empregado, Rendimento_anual, Tem_carro, Moradia]
Index: []

In [17]:
show_3 = text('SELECT * FROM Clientes WHERE ID_Cliente=6850985')
pd.read_sql(show_3, engine)

Empty DataFrame
Columns: [ID_Cliente, Idade, Grau_escolaridade, Estado_civil, Tamanho_familia, Categoria_de_renda, Ocupacao, Anos_empregado, Rendimento_anual, Tem_carro, Moradia]
Index: []

In [19]:
query_3 = text('INSERT INTO Clientes (ID_Cliente, Idade, Grau_escolaridade, Estado_civil, ' \
        'Tamanho_familia, Categoria_de_renda, Ocupacao, Anos_empregado, ' \
        'Rendimento_anual, Tem_carro, Moradia) ' \
        'VALUES (6850985, 33, "Doutorado", "Solteiro", 1, "Empregado", "TI", ' \
        '2, 290000, 0, "Casa/apartamento próprio")')

with engine.connect() as conn:
    conn.execute(query_3)
    conn.commit()

pd.read_sql(show_3, engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,6850985,33,Doutorado,Solteiro,1,Empregado,TI,2,290000.0,0,Casa/apartamento próprio